app/Controllers/DaftarRuangan.php

SELECT *
FROM `ruangan`
SELECT *
FROM `jadwal`
---
    public function daftarRuangan()
    {
        date_default_timezone_set('Asia/Jakarta');

        $dataArrRuangan = $this->Model_Ruangan->findAll();
        $dataArrJadwalRuangan = $this->Model_Jadwal->findAll();