app/Controllers/Index.php

    public function index()
    {
        date_default_timezone_set('Asia/Jakarta');

        $dataArrRuangan = $this->Model_Ruangan->findAll();
        $dataArrJadwalRuangan = $this->Model_Jadwal->findAll();
---
SELECT *
FROM `ruangan`
SELECT *
FROM `jadwal`