app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `nim` = '1234567'
 LIMIT 1
---
    public function login()
    {
        $ModelUsers = new \App\Models\Model_Users();
        $login = $this->request->getPost('login');

        if ($login) {
            $nim = $this->request->getPost('nim');
            $password = $this->request->getPost('password');


            $hash_password = hash('sha256', (string) $password);

            if (empty($err)) {
                $dataUser = $ModelUsers->where("nim", $nim)->first();