app/Controllers/Notifikasi.php

    public function notifikasi()
    {
        $dataArrPinjam_Ruangan = $this->Model_Pinjam_Ruangan->findAll();
        $dataArrRuangan = $this->Model_Ruangan->findAll();
---
SELECT *
FROM `pinjam_ruang`
SELECT *
FROM `ruangan`

    public function detailNotifikasi()
    {
        $dataArrPinjam_Ruangan = $this->Model_Pinjam_Ruangan->findAll();
        $dataArrRuangan = $this->Model_Ruangan->findAll();
        $Model_Users = $this->Model_Users->findAll();
---
SELECT *
FROM `pinjam_ruang`
SELECT *
FROM `ruangan`
SELECT *
FROM `users`

    public function deleteNotifikasi()
    {
        if ($this->request->getMethod() === 'post') {
            $data_id_notifikasi = $this->request->getPost('notifikasi_id');

            $this->Model_Pinjam_Ruangan->delete($data_id_notifikasi);
---
DELETE FROM `pinjam_ruang`
WHERE `id` IN ('20')