app/Controllers/Register.php

INSERT INTO `users` (`nama_depan`, `nama_belakang`, `nim`, `email`, `password`, `status`, `foto`) VALUES ('tes', 'tes2', '1234567', 'tes@gmail.com', '008c70392e3abfbd0fa47bbc2ed96aa99bd49e159727fcba0f2e6abeb3a9d601', 'user', '110x110.jpg')
---
    public function addAccount()
    {
        if ($this->request->getMethod() === 'post') {
            $data_fname = $this->request->getPost('f_name');
            $data_lname = $this->request->getPost('l_name');
            $data_nim = $this->request->getPost('nim');
            $data_email = $this->request->getPost('email');
            $data_password = $this->request->getPost('password');
            $photoProfile = '110x110.jpg';

            $hash_password = hash('sha256', (string) $data_password);

            $data_Register = [
                'nama_depan' => $data_fname,
                'nama_belakang' => $data_lname,
                'nim' => $data_nim,
                'email' => $data_email,
                'password' => $hash_password,
                'status' => "user",
                'foto' => $photoProfile
            ];

            $this->Model_Users->insert($data_Register);